const PATTERN_LIST = [
  {
    label: '验证手机号码',
    value: '^1[3456789]\\d{9}$',
    message: '请输入正确的手机号码'
  },
  {
    label: '验证数字',
    value: '^[0-9]*$',
    message: '只能输入数字'
  },

  {
    label: '验证身份证号',
    value: '^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|31)|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}([0-9]|x|X)$',
    message: '请输入正确的身份证'
  },
  {
    label: '验证数字和26个英文字母组成的字符串',
    value: '^[A-Za-z0-9]+$',
    message: '只能输入数字和英文'
  },

  {
    label: '验证汉字',
    value: '^[\u4E00-\u9FA5&]{0,}$',
    message: '只能输入汉字',
    tips: '0,可增加限制长度'
  },
  {
    label: '验证长度为3的字符',
    value: '^.{3}$',
    message: '请输入长度为3位字符',
    tips: '3要手动改成自己想要的位数'
  },
  {
    label: '验证m-n位的数字',
    value: '^\\d{m,n}$',
    message: '请输入m-n位数字',
    tips: 'm,n要手动改成自己想要的位数'
  }

]
export {
  PATTERN_LIST
}
